Revit 2027 API
AnnotationFamilyUtils.SetIsLeaderSnapReference Method
 Sets if the element is a leader snap reference for annotation leader snapping.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static void SetIsLeaderSnapReference(
	Element element,
	bool isSnapReference
)
Public Shared Sub SetIsLeaderSnapReference (
	element As Element,
	isSnapReference As Boolean
)
public:
static void SetIsLeaderSnapReference(
	Element^ element,
	bool isSnapReference
)
static member SetIsLeaderSnapReference :
        element : Element *
        isSnapReference : bool -> unit
Parameters
element Element
 The element to set.
isSnapReference Boolean
 Pass true to set the element as a leader snap reference, false otherwise.
Exceptions
Exception | Condition
ArgumentException |  element doesn't support the LEADER_SNAP_REFERENCE parameter.
ArgumentNullException |  A non-optional argument was null
Remarks
 This function controls the built-in parameter LEADER_SNAP_REFERENCE.
See Also
Reference
AnnotationFamilyUtils Class
Autodesk.Revit.DB Namespace